# Preprocessing data

## 1. Hanlding missing values

In [4]:
import pandas as pd

In [36]:
movies = pd.read_csv('ml-32m/movies.csv')
ratings = pd.read_csv('ml-32m/ratings.csv')
tags = pd.read_csv('ml-32m/tags.csv')
links = pd.read_csv('ml-32m/links.csv')

In [37]:
movies.head(2)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
1        2    Jumanji (1995)                   Adventure|Children|Fantasy

In [39]:
ratings.head(2)

   userId  movieId  rating  timestamp
0       1       17     4.0  944249077
1       1       25     1.0  944250228

In [21]:
tags.head(2)

   userId  movieId          tag   timestamp
0      22    26479  Kevin Kline  1583038886
1      22    79592     misogyny  1581476297

In [40]:
links.head(2)

   movieId  imdbId  tmdbId
0        1  114709   862.0
1        2  113497  8844.0

In [11]:
movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [25]:
tags.isnull().sum()

userId        0
movieId       0
tag          17
timestamp     0
dtype: int64

In [27]:
# tags['tag'].fillna("", inplace=True)
tags.fillna({'tag': ""}, inplace=True)

In [28]:
tags.isnull().sum()

userId       0
movieId      0
tag          0
timestamp    0
dtype: int64

In [29]:
ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [44]:
links.isnull().sum()

movieId      0
imdbId       0
tmdbId     124
dtype: int64

In [42]:
# Fill by 0 and convert to int
cleaned_links = links.copy()
cleaned_links['tmdbId'] = cleaned_links['tmdbId'].fillna(0).astype(int)
cleaned_links.isnull().sum()

movieId    0
imdbId     0
tmdbId     0
dtype: int64

In [49]:
cleaned_links_2  = links.copy()
missing_value_records = cleaned_links_2[cleaned_links_2.isna().any(axis=1)]
missing_value_records.head()

      movieId  imdbId  tmdbId
706       721  114103     NaN
715       730  125877     NaN
754       770   38426     NaN
775       791  113610     NaN
1080     1107  102336     NaN

In [50]:
cleaned_links_2.dropna(subset=['tmdbId'], inplace=True)
cleaned_links_2.isnull().sum()

movieId    0
imdbId     0
tmdbId     0
dtype: int64

In [52]:
missing_value_records = cleaned_links_2[cleaned_links_2.isna().any(axis=1)]
missing_value_records.head()

Empty DataFrame
Columns: [movieId, imdbId, tmdbId]
Index: []

## 2. Removing duplicates

## 3. Transforming data

## 4. Normalzing & Scaling features

## 5. Merging datasets

## 6.Saving the cleaned data